-- Создание таблицы "Соискатели"
CREATE TABLE [dbo].[Соискатели] (
    [id_соискателя] INT           IDENTITY (1, 1) NOT NULL,
    [фио]           NVARCHAR (50) NOT NULL,
    [пол]           NVARCHAR (50) NOT NULL,
    [дата_рождения] DATE          NOT NULL,
    [телефон]       NVARCHAR (50) NOT NULL,
    [знание_языка] NVARCHAR(50) NULL, 
    PRIMARY KEY CLUSTERED ([id_соискателя] ASC)
);

-- Создание таблицы "ВидыОбразования"
CREATE TABLE [dbo].[ВидыОбразования]
(
	[id_ВидаОбразования] INT IDENTITY(1,1) NOT NULL PRIMARY KEY, 
    [наименование] NVARCHAR(50) NOT NULL
);

CREATE TABLE [dbo].[Вакансии] (
    [id_вакансии]   INT           IDENTITY (1, 1) NOT NULL,
    [должность]     NVARCHAR (50) NOT NULL,
    [опыт]          INT           NOT NULL,
    [зп]            DECIMAL (18)  NOT NULL,
    [активность]    NVARCHAR (50) NOT NULL,
    [дата_закрытия] DATE          NULL,
    [id_ВидаОбразования] INT NOT NULL, 
    PRIMARY KEY CLUSTERED ([id_вакансии] ASC),
	FOREIGN KEY ([id_ВидаОбразования]) REFERENCES [dbo].[ВидыОбразования] ([id_ВидаОбразования])
);

-- Создание таблицы "Заявки"
CREATE TABLE [dbo].[Заявки] (
    [id_заявки]     INT           IDENTITY (1, 1) NOT NULL,
    [id_вакансии]   INT           NOT NULL,
    [id_соискателя] INT           NOT NULL,
    [статус]        NVARCHAR (50) NOT NULL,
    [дата] DATE NULL, 
    PRIMARY KEY CLUSTERED ([id_заявки] ASC),
    FOREIGN KEY ([id_вакансии]) REFERENCES [dbo].[Вакансии] ([id_вакансии]),
    FOREIGN KEY ([id_соискателя]) REFERENCES [dbo].[Соискатели] ([id_соискателя])
);

-- Создание таблицы "Образование"
CREATE TABLE [dbo].[Образование] (
    [id_образования] INT           IDENTITY (1, 1) NOT NULL,
    [id_соискателя]  INT           NOT NULL,
    [наименование]   NVARCHAR (50) NOT NULL,
    [специальность]  NVARCHAR (50) NOT NULL,
    [номерДиплома]   NVARCHAR (50) NOT NULL,
    [дата_конца]     DATE          NOT NULL,
    [id_ВидаОбразования] INT NOT NULL, 
    PRIMARY KEY CLUSTERED ([id_образования] ASC),
    FOREIGN KEY ([id_соискателя]) REFERENCES [dbo].[Соискатели] ([id_соискателя]),
	FOREIGN KEY ([id_ВидаОбразования]) REFERENCES [dbo].[ВидыОбразования] ([id_ВидаОбразования])
);

-- Создание таблицы "ОпытРаботы"
CREATE TABLE [dbo].[ОпытРаботы]
(
    [id_опыта_работы] INT IDENTITY(1,1) NOT NULL PRIMARY KEY, 
    [id_соискателя] INT NOT NULL, 
    [наименование] NVARCHAR(50) NOT NULL, 
    [должность] NVARCHAR(50) NOT NULL, 
    [дата_начала] DATE NOT NULL, 
    [дата_конца] DATE NOT NULL,
    FOREIGN KEY (id_соискателя) REFERENCES [dbo].[Соискатели](id_соискателя)
);


CREATE TABLE [dbo].[ВоинскийУчёт] (
    [id_военки] INT           IDENTITY (1, 1) NOT NULL,
    [id_соискателя]   INT           NOT NULL,
    [годность]    NVARCHAR (50) NOT NULL,
    [дата_начала]     DATE          NULL,
    [дата_конца]      DATE          NULL,
    PRIMARY KEY CLUSTERED ([id_военки] ASC),
    FOREIGN KEY ([id_соискателя]) REFERENCES [dbo].[Соискатели] ([id_соискателя])
);

-- Заполнение таблицы Соискатели
INSERT INTO [dbo].[Соискатели] ([фио], [пол], [дата_рождения], [телефон], [знание_языка])
VALUES 
(N'Иванов Иван Иванович', N'Мужской', '1990-01-01', N'+79990001122', N'Английский'),
(N'Петров Петр Петрович', N'Мужской', '1985-05-23', N'+79990003344', N'Немецкий'),
(N'Сидорова Мария Ивановна', N'Женский', '1992-07-14', N'+79990005566', N'Французский');

-- Заполнение таблицы ВидыОбразования
INSERT INTO [dbo].[ВидыОбразования] ([наименование])
VALUES 
(N'Общее базовое'),
(N'Общее среднее'),
(N'Профессионально техническое'),
(N'Среднее специальное'),
(N'Высшее');

-- Заполнение таблицы Вакансии
INSERT INTO [dbo].[Вакансии] ([должность], [опыт], [зп], [активность], [id_ВидаОбразования])
VALUES 
(N'Программист', 3, 60000.00, N'Активно', 5), -- Высшее
(N'Менеджер', 5, 50000.00, N'Неактивно', 4), -- Среднее специальное
(N'Аналитик', 2, 45000.00, N'Активно', 5); -- Высшее

-- Заполнение таблицы Заявки
INSERT INTO [dbo].[Заявки] ([id_вакансии], [id_соискателя], [статус], [дата])
VALUES 
(1, 1, N'Принято', '2024-05-01'),
(2, 2, N'Отклонено', '2024-05-02'),
(3, 3, N'На рассмотрении', '2024-05-03');

-- Заполнение таблицы Образование
INSERT INTO [dbo].[Образование] ([id_соискателя], [наименование], [специальность], [номерДиплома], [дата_конца], [id_ВидаОбразования])
VALUES 
(1, N'МГУ', N'Программист', '2392839823', '2013-06-30', 5), -- Высшее
(2, N'СПбГУ', N'Экономист', '2389728793', '2010-06-30', 5), -- Высшее
(3, N'Политех', N'Инженер', '2303920989', '2014-06-30', 4); -- Среднее специальное

-- Заполнение таблицы ОпытРаботы
INSERT INTO [dbo].[ОпытРаботы] ([id_соискателя], [наименование], [должность], [дата_начала], [дата_конца])
VALUES 
(1, N'ООО Программные Решения', N'Программист', '2014-07-01', '2020-12-31'),
(2, N'АО Экономика', N'Менеджер', '2011-01-01', '2018-12-31'),
(3, N'ЗАО Инжиниринг', N'Инженер', '2015-01-01', '2022-12-31');

-- Заполнение таблицы ВоинскийУчёт
INSERT INTO [dbo].[ВоинскийУчёт] ([id_соискателя], [годность], [дата_начала], [дата_конца])
VALUES 
(1, N'Годен', NULL, NULL),
(2, N'Не годен и снимается с воинского учёта', '2019-01-01', '2019-12-31'),
(3, N'Годен с ограничениями', '2020-01-01', '2020-12-31');


-- Скрипт для удаления всех таблиц

-- Удаление таблиц, которые ссылаются на другие таблицы
DROP TABLE IF EXISTS [dbo].[Заявки];
DROP TABLE IF EXISTS [dbo].[Образование];
DROP TABLE IF EXISTS [dbo].[ОпытРаботы];
DROP TABLE IF EXISTS [dbo].[ВоинскийУчёт];

-- Удаление таблиц, на которые ссылаются другие таблицы
DROP TABLE IF EXISTS [dbo].[Вакансии];
DROP TABLE IF EXISTS [dbo].[Соискатели];
DROP TABLE IF EXISTS [dbo].[ВидыОбразования];